# **Getting Started with pandas**

Throughout the rest of the book, I use the following import convention for pandas:

In [141]:
import pandas as pd

Thus, whenever you see pd. in code, it’s referring to pandas. You may also find it eas‐
ier to import Series and DataFrame into the local namespace since they are so fre‐
quently used:

In [142]:
from pandas import Series, DataFrame

#### **5.1 Introduction to pandas Data Structures**

To get started with pandas, you will need to get comfortable with its two workhorse
data structures: Series and DataFrame. While they are not a universal solution for
every problem, they provide a solid, easy-to-use basis for most applications.

#### **Series**

A Series is a one-dimensional array-like object containing a sequence of values (of
similar types to NumPy types) and an associated array of data labels, called its index. The simplest Series is formed from only an array of data:

In [143]:
obj = pd.Series([4,7,-5,3])

In [144]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

The string representation of a Series displayed interactively shows the index on the
left and the values on the right. Since we did not specify an index for the data, a
default one consisting of the integers 0 through N - 1 (where N is the length of the
data) is created. You can get the array representation and index object of the Series via its values and index attributes, respectively:

In [145]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [146]:
obj.index # like range(4)

RangeIndex(start=0, stop=4, step=1)

Often it will be desirable to create a Series with an index identifying each data point
with a label:

In [147]:
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])

In [148]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [149]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

Compared with NumPy arrays, you can use labels in the index when selecting single
values or a set of values:

In [150]:
obj2['a']

-5

In [151]:
obj2['d'] = 6

In [152]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

Here ['c', 'a', 'd'] is interpreted as a list of indices, even though it contains
strings instead of integers.

Using NumPy functions or NumPy-like operations, such as filtering with a boolean
array, scalar multiplication, or applying math functions, will preserve the index-value
link:

In [153]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [154]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [155]:
import numpy as np

In [156]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping of index values to data values. It can be used in many contexts where you might
use a dict:

In [157]:
'b' in obj2

True

In [158]:
'e' in obj2

False

Should you have data contained in a Python dict, you can create a Series from it by
passing the dict:

In [159]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [160]:
obj3 = pd.Series(sdata)

In [161]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

When you are only passing a dict, the index in the resulting Series will have the dict’s keys in sorted order. You can override this by passing the dict keys in the order you want them to appear in the resulting Series:

In [162]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [163]:
obj4 = pd.Series(sdata, index=states)

In [164]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Here, three values found in sdata were placed in the appropriate locations, but since
no value for 'California' was found, it appears as **NaN** (not a number), which is considered in pandas to mark missing or NA values. Since 'Utah' was not included in
states, it is excluded from the resulting object.

I will use the terms “missing” or “NA” interchangeably to refer to missing data. The
isnull and notnull functions in pandas should be used to detect missing data:

In [165]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [166]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

Series also has these as instance methods:

In [167]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

A useful Series feature for many applications is that it automatically aligns by index label in arithmetic operations:

In [168]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [169]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [170]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Data alignment features will be addressed in more detail later. If you have experience with databases, you can think about this as being similar to a join operation.

Both the Series object itself and its index have a name attribute, which integrates with other key areas of pandas functionality:

In [171]:
obj4.name = 'population'

In [172]:
obj4.index.name = 'state'

In [173]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

A Series’s index can be altered in-place by assignment:

In [174]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [175]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [176]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### **DataFrame**

A DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type (numeric, string,
boolean, etc.). The DataFrame has both a row and column index; it can be thought of
as a dict of Series all sharing the same index. Under the hood, the data is stored as one
or more two-dimensional blocks rather than a list, dict, or some other collection of
one-dimensional arrays. The exact details of DataFrame’s internals are outside the
scope of this book.

There are many ways to construct a DataFrame, though one of the most common is
from a dict of equal-length lists or NumPy arrays:

In [177]:
data = {'state': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year':[2000,2001,2002,2001,2002,2003],
        'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)

In [178]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

For large DataFrames, the head method selects only the first five rows:

In [179]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

If you specify a sequence of columns, the DataFrame’s columns will be arranged in
that order:

In [180]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

If you pass a column that isn’t contained in the dict, it will appear with missing values
in the result:

In [181]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])

In [182]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [183]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

A column in a DataFrame can be retrieved as a Series either by dict-like notation or
by attribute:

In [184]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [185]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [186]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

Note that the returned Series have the same index as the DataFrame, and their name
attribute has been appropriately set.

Rows can also be retrieved by position or name with the special loc attribute (much
more on this later):

In [187]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

Columns can be modified by assignment. For example, the empty 'debt' column
could be assigned a scalar value or an array of values:

In [188]:
frame2['debt'] = 16.5

In [189]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [190]:
frame2['debt'] = np.arange(6.)

In [191]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

When you are assigning lists or arrays to a column, the value’s length must match the
length of the DataFrame. If you assign a Series, its labels will be realigned exactly to the DataFrame’s index, inserting missing values in any holes:

In [192]:
val = pd.Series([-1.2,-1.5,-1.7], index=['two', 'four', 'five'])

In [193]:
frame2['debt'] = val

In [194]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

Assigning a column that doesn’t exist will create a new column. The del keyword will
delete columns as with a dict.

As an example of del, I first add a new column of boolean values where the state
column equals 'Ohio':

In [195]:
frame2['eastern'] = frame2.state == 'Ohio'

In [196]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

New columns cannot be created with the frame2.eastern syntax.

The del method can then be used to remove this column:

In [197]:
del frame2['eastern']

In [198]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

The column returned from indexing a DataFrame is a view on the
underlying data, not a copy. Thus, any in-place modifications to the
Series will be reflected in the DataFrame. The column can be
explicitly copied with the Series’s copy method.

Another common form of data is a nested dict of dicts:

In [199]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

If the nested dict is passed to the DataFrame, pandas will interpret the outer dict keys
as the columns and the inner keys as the row indices:

In [200]:
frame3 = pd.DataFrame(pop)

In [201]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

You can transpose the DataFrame (swap rows and columns) with similar syntax to a
NumPy array

In [202]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

The keys in the inner dicts are combined and sorted to form the index in the result.
This isn’t true if an explicit index is specified:

In [203]:
pd.DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

Dicts of Series are treated in much the same way:

In [204]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}

In [205]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

If a DataFrame’s index and columns have their name attributes set, these will also be
displayed:

In [206]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [207]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

As with Series, the values attribute returns the data contained in the DataFrame as a
two-dimensional ndarray:

In [208]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

If the DataFrame’s columns are different dtypes, the dtype of the values array will be chosen to accommodate all of the columns:

In [209]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

Table 5-1. Possible data inputs to DataFrame constructor

![alt text](Data/1.JPG)

## **Index Object**

pandas’s Index objects are responsible for holding the axis labels and other metadata
(like the axis name or names). Any array or other sequence of labels you use when
constructing a Series or DataFrame is internally converted to an Index:

In [210]:
import numpy as np
import pandas as pd

In [211]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [212]:
index = obj.index

In [213]:
index

Index(['a', 'b', 'c'], dtype='object')

In [214]:
index[1:]

Index(['b', 'c'], dtype='object')

Index objects are immutable and thus can’t be modified by the user:

In [215]:
index[1] = 'd'

TypeError: Index does not support mutable operations

Immutability makes it safer to share Index objects among data structures:

In [216]:
labels = pd.Index(np.arange(3))

In [217]:
labels

Index([0, 1, 2], dtype='int32')

In [218]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [219]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [220]:
obj2.index is labels

True

In addition to being array-like, an Index also behaves like a fixed-size set:

In [221]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [222]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [223]:
'Ohio' in frame3.index

False

Unlike Python sets, a pandas Index can contain duplicate labels:

In [224]:
dup_labels = pd.Index(['foo','foo','bar','bar'])

In [225]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

Table 5-2. Some Index methods and properties

![alt text](Data/2.JPG)

# **5.2 Essential Functionality**

## **Reindexing**

An important method on pandas objects is reindex, which means to create a new
object with the data conformed to a new index. Consider an example:

In [226]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])

In [227]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

Calling reindex on this Series rearranges the data according to the new index, intro‐
ducing missing values if any index values were not already present:

In [228]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [229]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

For ordered data like time series, it may be desirable to do some interpolation or fill‐ing of values when reindexing. The method option allows us to do this, using a
method such as ffill, which forward-fills the values:

In [230]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [231]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [232]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

With DataFrame, reindex can alter either the (row) index, columns, or both. When
passed only a sequence, it reindexes the rows in the result:

In [233]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])

In [234]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [235]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [236]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

The columns can be reindexed with the columns keyword:

In [237]:
states = ['Texas', 'Utah', 'California']

In [238]:
frame3.reindex(columns=states)

state  Texas  Utah  California
year
2001     NaN   NaN         NaN
2002     NaN   NaN         NaN
2000     NaN   NaN         NaN

In [239]:
frame4 = frame.reindex(index=['a','b','c','d'], columns=states)

In [240]:
frame4

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [241]:
frame4.loc[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

Table 5-3. reindex function arguments

![alt text](Data/3.JPG)

## **Dropping Entries from an Axis**

Dropping one or more entries from an axis is easy if you already have an index array
or list without those entries. As that can require a bit of munging and set logic, the drop method will return a new object with the indicated value or values deleted from an axis:

In [242]:
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])

In [243]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [244]:
new_obj = obj.drop('c')

In [245]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [246]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

With DataFrame, index values can be deleted from either axis. To illustrate this, we
first create an example DataFrame:

In [247]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['Ohio','Colorado','Utah','New York'],
                    columns=['one','two','three','four'])

In [248]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Calling drop with a sequence of labels will drop values from the row labels (axis 0):

In [249]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

You can drop values from the columns by passing axis=1 or axis='columns':

In [250]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [251]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

Many functions, like drop, which modify the size or shape of a Series or DataFrame,
can manipulate an object in-place without returning a new object:

In [252]:
obj.drop('c', inplace=True)

In [253]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

Be careful with the inplace, as it destroys any data that is dropped.

## **Indexing, Selection, and Filtering**

Series indexing (obj[...]) works analogously to NumPy array indexing, except you
can use the Series’s index values instead of only integers. Here are some examples of
this:

In [254]:
obj = pd.Series(np.arange(4.), index=['a','b','c','d'])

In [255]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [256]:
obj[1]

C:\Users\zafir\AppData\Local\Temp\ipykernel_12628\2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1.0

In [257]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [258]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [259]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

Slicing with labels behaves differently than normal Python slicing in that the end‐
point is inclusive:

In [260]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

Setting using these methods modifies the corresponding section of the Series:

In [261]:
obj['b':'c'] = 5

In [262]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

Indexing into a DataFrame is for retrieving one or more columns either with a single
value or sequence:

In [263]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [264]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [265]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [266]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

Indexing like this has a few special cases. First, slicing or selecting data with a boolean array:

In [267]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [268]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

The row selection syntax data[:2] is provided as a convenience. Passing a single element or a list to the [] operator selects columns.

Another use case is in indexing with a boolean DataFrame, such as one produced by a
scalar comparison:

In [269]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [270]:
data[data < 5] = 0

In [271]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

This makes DataFrame syntactically more like a two-dimensional NumPy array in
this particular case

## **Selection with loc and iloc**

For DataFrame label-indexing on the rows, I introduce the special indexing operators
loc and iloc. They enable you to select a subset of the rows and columns from a
DataFrame with NumPy-like notation using either axis labels (loc) or integers
(iloc).

As a preliminary example, let’s select a single row and multiple columns by label:

In [272]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [273]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

We’ll then perform some similar selections with integers using iloc:

In [274]:
data.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [275]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [276]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

Both indexing functions work with slices in addition to single labels or lists of labels:

In [277]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [278]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

Table 5-4. Indexing options with DataFrame

![alt text](Data/4.JPG)

## **Integer Indexes**

Working with pandas objects indexed by integers is something that often trips up
new users due to some differences with indexing semantics on built-in Python data
structures like lists and tuples. For example, you might not expect the following code to generate an error:

In [279]:
ser = pd.Series(np.arange(3.))

In [280]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [281]:
ser[-1]

KeyError: -1

In this case, pandas could “fall back” on integer indexing, but it’s difficult to do this in
general without introducing subtle bugs. Here we have an index containing 0, 1, 2,
but inferring what the user wants (label-based indexing or position-based) is difficult:

In [282]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

On the other hand, with a non-integer index, there is no potential for ambiguity:

In [283]:
ser2 = pd.Series(np.arange(3.), index=['a','b','c'])

In [284]:
ser2[-1]

C:\Users\zafir\AppData\Local\Temp\ipykernel_12628\811950851.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2.0

To keep things consistent, if you have an axis index containing integers, data selection will always be label-oriented. For more precise handling, use loc (for labels) or iloc (for integers):

In [285]:
ser[:1]

0    0.0
dtype: float64

In [286]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [287]:
ser.iloc[:1]

0    0.0
dtype: float64

## **Arithmetic and Data Alignment**

An important pandas feature for some applications is the behavior of arithmetic
between objects with different indexes. When you are adding together objects, if any
index pairs are not the same, the respective index in the result will be the union of the
index pairs. For users with database experience, this is similar to an automatic outer
join on the index labels. Let’s look at an example:

In [288]:
s1 = pd.Series([7.3,-2.5,3.4,1.5], index=['a','c','d','e'])

In [289]:
s2 = pd.Series([-2.1,3.6,-1.5,4,3.1],
               index=['a','c','e','f','g'])

In [290]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [291]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

Adding these together yields:

In [292]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

The internal data alignment introduces missing values in the label locations that don’t overlap. Missing values will then propagate in further arithmetic computations.

In the case of DataFrame, alignment is performed on both the rows and the columns:

In [293]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])

In [294]:
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [295]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [296]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

Adding these together returns a DataFrame whose index and columns are the unions
of the ones in each DataFrame:

In [297]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

Since the 'c' and 'e' columns are not found in both DataFrame objects, they appear
as all missing in the result. The same holds for the rows whose labels are not common to both objects.

If you add DataFrame objects with no column or row labels in common, the result
will contain all nulls:

In [298]:
df1 = pd.DataFrame({'A':[1,2]})

In [299]:
df2 = pd.DataFrame({'B':[3,4]})

In [300]:
df1

   A
0  1
1  2

In [301]:
df2

   B
0  3
1  4

In [302]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

## **Arithmetic methods with fill values**

In arithmetic operations between differently indexed objects, you might want to fill with a special value, like 0, when an axis label is found in one object but not the other:

In [303]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
                   columns=list('abcd'))

In [304]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                   columns=list('abcde'))

In [305]:
df2.loc[1,'b'] = np.nan

In [306]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [307]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

Adding these together results in NA values in the locations that don’t overlap:

In [308]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

Using the add method on df1, I pass df2 and an argument to fill_value:

In [309]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

See Table 5-5 for a listing of Series and DataFrame methods for arithmetic. Each of
them has a counterpart, starting with the letter r, that has arguments flipped. So these
two statements are equivalent:

In [310]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [311]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

Relatedly, when reindexing a Series or DataFrame, you can also specify a different fill value:

In [312]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

Table 5-5. Flexible arithmetic methods

![alt text](Data/5.JPG)

## **Operations between DataFrame and Series**

As with NumPy arrays of different dimensions, arithmetic between DataFrame and
Series is also defined. First, as a motivating example, consider the difference between a two-dimensional array and one of its rows:

In [313]:
arr = np.arange(12.).reshape((3,4))

In [314]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [315]:
arr[0]

array([0., 1., 2., 3.])

In [316]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

Operations between a DataFrame and a Series are
similar:

In [317]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [318]:
series = frame.iloc[0]

In [319]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [320]:
series

b    0
d    1
e    2
Name: Utah, dtype: int32

By default, arithmetic between DataFrame and Series matches the index of the Series
on the DataFrame’s columns, broadcasting down the rows:

In [321]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

If an index value is not found in either the DataFrame’s columns or the Series’s index,
the objects will be reindexed to form the union:

In [322]:
series2 = pd.Series(range(3), index=['b','e','f'])

In [323]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

If you want to instead broadcast over the columns, matching on the rows, you have to
use one of the arithmetic methods. For example:

In [324]:
series3 = frame['d']

In [325]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [326]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int32

In [327]:
frame.sub(series3, axis='index')

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

The axis number that you pass is the axis to match on. In this case we mean to match on the DataFrame’s row index (axis='index' or axis=0) and broadcast across.

## **Function Application and Mapping**

NumPy ufuncs (element-wise array methods) also work with pandas objects:

In [328]:
frame = pd.DataFrame(np.random.randn(4,3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [329]:
frame

               b         d         e
Utah    0.896411 -0.355558  2.046022
Ohio    1.712681 -0.056689 -0.862719
Texas  -1.711297 -0.423002  0.041800
Oregon -0.451929  0.762285 -0.827925

In [330]:
np.abs(frame)

               b         d         e
Utah    0.896411  0.355558  2.046022
Ohio    1.712681  0.056689  0.862719
Texas   1.711297  0.423002  0.041800
Oregon  0.451929  0.762285  0.827925

Another frequent operation is applying a function on one-dimensional arrays to each
column or row. DataFrame’s apply method does exactly this:

In [331]:
f = lambda x: x.max() - x.min()

In [332]:
frame.apply(f)

b    3.423978
d    1.185287
e    2.908741
dtype: float64

Here the function f, which computes the difference between the maximum and mini‐
mum of a Series, is invoked once on each column in frame. The result is a Series having the columns of frame as its index.

If you pass axis='columns' to apply, the function will be invoked once per row
instead:

In [333]:
frame.apply(f, axis='columns')

Utah      2.401580
Ohio      2.575400
Texas     1.753097
Oregon    1.590210
dtype: float64

Many of the most common array statistics (like sum and mean) are DataFrame methods, so using apply is not necessary.

The function passed to apply need not return a scalar value; it can also return a Series with multiple values:

In [334]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [335]:
frame.apply(f)

            b         d         e
min -1.711297 -0.423002 -0.862719
max  1.712681  0.762285  2.046022

Element-wise Python functions can be used, too. Suppose you wanted to compute a
formatted string from each floating-point value in frame. You can do this with apply map:

In [336]:
format = lambda x: '%.2f' % x

In [337]:
frame.applymap(format)

C:\Users\zafir\AppData\Local\Temp\ipykernel_12628\304758519.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(format)

            b      d      e
Utah     0.90  -0.36   2.05
Ohio     1.71  -0.06  -0.86
Texas   -1.71  -0.42   0.04
Oregon  -0.45   0.76  -0.83

The reason for the name applymap is that Series has a map method for applying an
element-wise function:

In [338]:
frame['e'].map(format)

Utah       2.05
Ohio      -0.86
Texas      0.04
Oregon    -0.83
Name: e, dtype: object

## **Sorting and Ranking**

Sorting a dataset by some criterion is another important built-in operation. To sort lexicographically by row or column index, use the sort_index method, which returns
a new, sorted object:

In [339]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [340]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

With a DataFrame, you can sort by index on either axis:

In [341]:
frame = pd.DataFrame(np.arange(8).reshape(2,4),
                     index=['three','one'],
                     columns=['d','a','b','c'])

In [342]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [343]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

The data is sorted in ascending order by default, but can be sorted in descending
order, too:

In [344]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

To sort a Series by its values, use its sort_values method:

In [345]:
obj = pd.Series([4, 7, -3, 2])

In [346]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

Any missing values are sorted to the end of the Series by default:

In [347]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [348]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

When sorting a DataFrame, you can use the data in one or more columns as the sort
keys. To do so, pass one or more column names to the by option of sort_values:

In [349]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [350]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [351]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

To sort by multiple columns, pass a list of names:

In [352]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

Ranking assigns ranks from one through the number of valid data points in an array.
The rank methods for Series and DataFrame are the place to look; by default rank
breaks ties by assigning each group the mean rank:

In [353]:
obj = pd.Series([7,-5,7,4,2,0,4])

In [354]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

Ranks can also be assigned according to the order in which they’re observed in the
data:

In [355]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

Here, instead of using the average rank 6.5 for the entries 0 and 2, they instead have been set to 6 and 7 because label 0 precedes label 2 in the data.

You can rank in descending order, too:

In [356]:
# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

DataFrame can compute ranks over the rows or the columns:

In [357]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})

In [358]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [359]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

Table 5-6. Tie-breaking methods with rank

![alt text](Data/6.JPG)

## **Axis Indexes with Duplicate Labels**

Up until now all of the examples we’ve looked at have had unique axis labels (index
values). While many pandas functions (like reindex) require that the labels be
unique, it’s not mandatory. Let’s consider a small Series with duplicate indices:

In [360]:
obj = pd.Series(range(5), index=['a','a','b','b','c'])

In [361]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

The index’s is_unique property can tell you whether its labels are unique or not:

In [362]:
obj.index.is_unique

False

Data selection is one of the main things that behaves differently with duplicates.
Indexing a label with multiple entries returns a Series, while single entries return a
scalar value:

In [363]:
obj['a']

a    0
a    1
dtype: int64

In [364]:
obj['c']

4

This can make your code more complicated, as the output type from indexing can
vary based on whether a label is repeated or not.

The same logic extends to indexing rows in a DataFrame:

In [365]:
df = pd.DataFrame(np.random.randn(4,3), index=['a','a','b','b'])

In [366]:
df

          0         1         2
a -0.557199 -0.267511 -0.981212
a -1.188999  1.114919 -0.430478
b -1.528382  0.610130  0.509325
b  0.232242 -0.462475 -0.359519

In [367]:
df.loc['b']

          0         1         2
b -1.528382  0.610130  0.509325
b  0.232242 -0.462475 -0.359519

## **5.3 Summarizing and Computing Descriptive Statistics**

pandas objects are equipped with a set of common mathematical and statistical methods. Most of these fall into the category of reductions or summary statistics, methods that extract a single value (like the sum or mean) from a Series or a Series of values from the rows or columns of a DataFrame. Compared with the similar methods
found on NumPy arrays, they have built-in handling for missing data. Consider a
small DataFrame:

In [368]:
df = DataFrame([[1.4,np.nan], [7.1,-4.5],
                [np.nan,np.nan], [0.75,-1.3]],
                index=['a','b','c','d'],
                columns=['one','two'])

In [369]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

Calling DataFrame’s sum method returns a Series containing column sums:

In [370]:
df.sum()

one    9.25
two   -5.80
dtype: float64

Passing axis='columns' or axis=1 sums across the columns instead:

In [371]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

NA values are excluded unless the entire slice (row or column in this case) is NA.
This can be disabled with the skipna option:

In [372]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

Table 5-7. Options for reduction methods

![alt text](Data/7.JPG)

Some methods, like idxmin and idxmax, return indirect statistics like the index value
where the minimum or maximum values are attained:

In [373]:
df.idxmax()

one    b
two    d
dtype: object

Other methods are accumulations:

In [374]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

Another type of method is neither a reduction nor an accumulation. describe is one
such example, producing multiple summary statistics in one shot:

In [375]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

On non-numeric data, describe produces alternative summary statistics:

In [376]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [377]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

Table 5-8. Descriptive and summary statistics

![alt text](Data/8.JPG)

# *Old Methods*
## **Correlation and Covariance**

Some summary statistics, like correlation and covariance, are computed from pairs of
arguments. Let’s consider some DataFrames of stock prices and volumes obtained
from Yahoo! Finance using the add-on pandas-datareader package. If you don’t
have it installed already, it can be obtained via conda or pip:

conda install pandas-datareader

pip install pandas-datareader

OR

conda install yfinance

pip install yfinance

I use the pandas_datareader module to download some data for a few stock tickers:

In [121]:
import yfinance as yf
import pandas as pd

In [122]:
# Defien the ticker symbol
# ticker = 'AAPL', 'IBM', 'MSFT', 'GOOG'
ticker = "AAPL"


# Download historical data for the ticker
all_data = yf.download(ticker, start="2010-01-01", end="2025-01-01")

# DIsplay the first few rows of the data to a CSV file
all_data.to_csv(f'Finance_historical_data.csv')

[*********************100%***********************]  1 of 1 completed

In [123]:
data = pd.read_csv("Finance_historical_data.csv",header=0).iloc[2:,:]

In [124]:
data.head()

,Price,Close,High,Low,Open,Volume
2,2010-01-04,6.4403300285339355,6.455075825369143,6.391277552762015,6.422875746236436,493729600
3,2010-01-05,6.451464653015137,6.487877930287253,6.417458516486256,6.458085394989272,601904800
4,2010-01-06,6.3488450050354,6.4770438212601515,6.342224263643306,6.4514640858562,552160000
5,2010-01-07,6.337108135223389,6.379841611717165,6.291065091462022,6.37231804159629,477131200
6,2010-01-08,6.379241466522217,6.379843754126937,6.2913689505515755,6.328684263710754,447610800

In [125]:
price = data["Close"]  # Use the 'Close' price as a proxy for 'Price'

In [126]:
price = data.iloc[:, 1]  # Assuming 'Close' is the second column

In [127]:
price = pd.to_numeric(data["Close"], errors='coerce')

In [131]:
volume = pd.to_numeric(data["Volume"], errors='coerce')

In [132]:
returns = price.pct_change()

In [133]:
returns.head()

2         NaN
3    0.219098
4   -0.082646
5   -0.135882
6   -0.061871
Name: Volume, dtype: float64

I now compute percent changes of the prices, a time series operation which will be
explored further in Chapter 11:

In [140]:
returns.tail()

3771   -0.431342
3772    0.172260
3773    0.555059
3774   -0.160495
3775    0.110334
Name: Volume, dtype: float64

# **New Methods**
## **Correlation and Covariance**

Some summary statistics, like correlation and covariance, are computed from pairs of
arguments. Let’s consider some DataFrames of stock prices and volumes obtained
from Yahoo! Finance using the add-on pandas-datareader package. If you don’t
have it installed already, it can be obtained via conda or pip:

conda install pandas-datareader

pip install pandas-datareader

OR

conda install yfinance

pip install yfinance

I use the pandas_datareader module to download some data for a few stock tickers:

### **Library**

In [101]:
import yfinance as yf
import pandas as pd

### **Download historical data for multiple stocks**

In [102]:
# Download historical data for multiple stocks
tickers = ["AAPL", "MSFT", "IBM", "GOOG"]
all_data = yf.download(tickers, start="2010-01-01", end="2025-01-01")["Close"]

[*********************100%***********************]  4 of 4 completed

### **Save to CSV**

In [103]:
all_data.to_csv("Finance_historical_data3.csv")

### **Load the data**

In [107]:
data = pd.read_csv("Finance_historical_data3.csv", index_col=0, parse_dates=True)

### **Calculate daily returns**

In [108]:
returns = data.pct_change()

In [109]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2024-12-24  0.011478  0.008062  0.011175  0.009374
2024-12-26  0.003176 -0.002379  0.002139 -0.002777
2024-12-27 -0.013242 -0.015525 -0.009382 -0.017302
2024-12-30 -0.013263 -0.006957 -0.011356 -0.013240
2024-12-31 -0.007058 -0.011677 -0.001907 -0.007838

### **Compute correlation and covariance between MSFT and IBM**

In [110]:
msft_ibm_corr = returns["MSFT"].corr(returns["IBM"])
msft_ibm_cov = returns["MSFT"].cov(returns["IBM"])

### **Compute full correlation matrix**

In [111]:
correlation_matrix = returns.corr()

### **Compute full covariance matrix**

In [112]:
covariance_matrix = returns.cov()

### **Display results**

In [113]:
print("MSFT & IBM Correlation:", msft_ibm_corr)
print("MSFT & IBM Covariance:", msft_ibm_cov)
print("\nCorrelation Matrix:\n", correlation_matrix)
print("\nCovariance Matrix:\n", covariance_matrix)

MSFT & IBM Correlation: 0.45381359973036206
MSFT & IBM Covariance: 0.00010222188147561531

Correlation Matrix:
           AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.546399  0.389218  0.588434
GOOG  0.546399  1.000000  0.382048  0.636345
IBM   0.389218  0.382048  1.000000  0.453814
MSFT  0.588434  0.636345  0.453814  1.000000

Covariance Matrix:
           AAPL      GOOG       IBM      MSFT
AAPL  0.000308  0.000165  0.000096  0.000166
GOOG  0.000165  0.000297  0.000092  0.000177
IBM   0.000096  0.000092  0.000196  0.000102
MSFT  0.000166  0.000177  0.000102  0.000260

Using DataFrame’s corrwith method, you can compute pairwise correlations
between a DataFrame’s columns or rows with another Series or DataFrame. Passing a
Series returns a Series with the correlation value computed for each column:

In [114]:
returns.corrwith(returns.IBM)

AAPL    0.389218
GOOG    0.382048
IBM     1.000000
MSFT    0.453814
dtype: float64

Passing a DataFrame computes the correlations of matching column names. Here I
compute correlations of percent changes with volume:

In [138]:
# Convert returns to DataFrame
returns_df = pd.DataFrame(returns)

# Now you can compute correlation with volume
corr_with_volume = returns_df.corrwith(volume)
print(corr_with_volume)

Volume    0.221938
dtype: float64

In [139]:
# Compute correlation between returns and volume directly
corr = returns.corr(volume)
print(corr)

0.22193801823390433

## **Unique Values, Value Counts, and Membership**

Another class of related methods extracts information about the values contained in a
one-dimensional Series. To illustrate these, consider this example:

In [378]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])

The first function is unique, which gives you an array of the unique values in a Series:

In [379]:
uniques = obj.unique()

In [380]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

The unique values are not necessarily returned in sorted order, but could be sorted
after the fact if needed (uniques.sort()). Relatedly, value_counts computes a Series
containing value frequencies:

In [381]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

The Series is sorted by value in descending order as a convenience. value_counts is
also available as a top-level pandas method that can be used with any array or
sequence:

In [382]:
pd.value_counts(obj.values, sort=False)

C:\Users\zafir\AppData\Local\Temp\ipykernel_12628\3084372382.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.values, sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

isin performs a vectorized set membership check and can be useful in filtering a
dataset down to a subset of values in a Series or column in a DataFrame:

In [383]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [384]:
mask = obj.isin(['b', 'c'])

In [385]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

Related to isin is the Index.get_indexer method, which gives you an index array
from an array of possibly non-distinct values into another array of distinct values:

In [386]:
to_match = pd.Series(['c','a','b','b','c','a'])

In [387]:
unique_vals = pd.Series(['c','b','a'])

In [388]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

Table 5-9. Unique, value counts, and set membership methods

![alt text](Data/9.JPG)

In some cases, you may want to compute a histogram on multiple related columns in
a DataFrame. Here’s an example:

In [389]:
data = pd.DataFrame({'Qu1': [1,2,4,3,4],
                     'Qu2': [2,3,1,2,3],
                     'Qu3': [1,5,2,4,4]})

In [390]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    2    3    5
2    4    1    2
3    3    2    4
4    4    3    4

Passing pandas.value_counts to this DataFrame’s apply function gives:

In [391]:
result = data.apply(pd.value_counts).fillna(0)

C:\Users\zafir\AppData\Local\Temp\ipykernel_12628\2451317050.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

In [392]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  1.0  2.0  1.0
3  1.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

Here, the row labels in the result are the distinct values occurring in all of the col‐
umns. The values are the respective counts of these values in each column.